package com.example.randomeveryday;

import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.webkit.WebView;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;

import java.util.Arrays;
import java.util.Collections;

public class drinkActivity extends AppCompatActivity {
    public ImageView ImageView;
    public TextView TextView;
    public Button Button;
    public WebView Showweb;
    public AlertDialog.Builder builder;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_drink);
        ImageView = (ImageView)findViewById(R.id.imageView);
        TextView = (TextView)findViewById(R.id.textView);
        Button = (Button)findViewById(R.id.button);
        Showweb=findViewById(R.id.WebView);
        Showweb.getSettings().setJavaScriptEnabled(true);
        showRandomFact();

        Button.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                showRandomFact();
            }
        });
    }

    public void showRandomFact(){
        shuffleFacts();
        ImageView.setImageResource(factArray[0].getmImage());
        TextView.setText(factArray[0].getmFact());
    }
    Facts f01 = new Facts(R.drawable.b1,"กาแฟโบราณ\n วิธีทำ\n" +
            "1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "3. ใส่น้ำตาลทรายลงในแก้ว ตามด้วยนมข้นหวาน เทโอเลี้ยงใส่ลงไป คนผสมให้เข้ากันจนน้ำตาลทรายละลาย เทใส่ลงในแก้วที่มีน้ำแข็งประมาณ 3/4 แก้ว แล้วเทนมข้นจืดลงไปจนเต็มแก้ว พร้อมเสิร์ฟ\n");
    Facts f02 = new Facts(R.drawable.b2, "เนสกาแฟ\n"+
            "วิธีทำ\n"+
     "1. ใส่ผงกาแฟและน้ำตาลทรายลงในแก้ว เติมน้ำร้อนลงไป คนให้ละลาย\n"+
     "2. เติมนมข้นหวานลงไป คนให้เข้ากัน\n"+
     "3. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n");
    Facts f03 = new Facts(R.drawable.b3, "โอเลี้ยง\n วิธีทำ\n" +
            "     1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "     2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "     3. ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็งจนเต็ม พร้อมเสิร์ฟ\n");
    Facts f04 = new Facts(R.drawable.b4, "ยกล้อ\n วิธีทำ\n" +
            "     1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "     2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "     3. ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็ง ประมาณ 3/4 แก้ว แล้วเทนมข้นจืดลงไปจนเต็มแก้ว พร้อมเสิร์ฟ\n");
    Facts f05 = new Facts(R.drawable.b5, "ชาเย็น\n วิธีทำ\n" +
            "     1. ผสมชาทั้ง 3 อย่างเข้าด้วยกัน ลักษณะผงชาที่ได้จะมีทั้งลักษณะที่เป็นผงละเอียดและเป็นก้านใบชาที่หยาบ ๆ\n" +
            "     2. ตวงน้ำ 1,500 มิลลิลิตร แล้วนำไปต้มให้น้ำเดือด\n" +
            "     3. นำผงชาที่เตรียมไว้เทใส่ถุงกรองชา แล้วเทน้ำร้อนผ่านถุงกรองชาที่มีผงชาอยู่ โดยวางถุงกรองชาไว้ในกระบอกสเตนเลส (ซึ่งมีไว้สำหรับการชงชา แต่ถ้าใครไม่มีกระบอกสเตนเลสหรือมือใหม่หัดชง ก็ใช้พวกหม้อที่ใช้ตามบ้านแทนก็ได้)\n" +
            "**เทคนิคสำคัญ** ให้เทชาสลับไปสลับมาประมาณ 12 รอบ ให้ผงชาในถุงกรองชุ่มฉ่ำ เวลาเทก็ต้องชักถุงชาขึ้นมา (ถือถุงชาให้สูงขึ้นเพื่อให้ผงชาได้สัมผัสกับอากาศด้วย กลิ่นชาและรสชาติชาจะออกมาได้ดี)\n" +
            "     4. เมื่อเทชาสลับไปสลับมาครบ 12 รอบแล้ว จึงแช่ชาทิ้งไว้ประมาณ 5 นาที จากนั้นยกถุงกรองชาออก บีบน้ำชาที่เกาะอยู่ในถุงกรองชา คั้นน้ำออกมาให้หมด\n" +
            "     5. เติมครีมเทียมลงไปในน้ำชาที่พักไว้ คนผสมให้เข้ากัน\n" +
            "     6. เติมนมข้นหวานและนมข้นจืดลงไป (เพื่อเพิ่มความมัน หรือใครจะใส่นมข้นจืดมากกว่านี้ก็ไม่เป็นไร แล้วแต่ความชอบ) ตามด้วยน้ำเชื่อม คนผสมให้เข้ากันดี ชิมรสตามชอบ วางตั้งพักไว้รอให้เย็นก่อนแล้วจึงเทใส่ขวด\n");
    Facts f06 = new Facts(R.drawable.b6, "ชาดำเย็น\n วิธีทำ\n" +
            "     1. ใส่น้ำตาลทรายลงในแก้ว เทน้ำชาลงไปคนให้ละลายเข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n");
    Facts f07 = new Facts(R.drawable.b7, "โกโก้เย็น\n วิธีชง\n" +
            "     1. ใส่ส่วนผสมทุกอย่างลงในแก้ว ตามด้วยน้ำร้อน คนให้เข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง ราดนมข้นจืดลงไปด้านบน พร้อมเสิร์ฟ\n");
    Facts f09 = new Facts(R.drawable.b8, "นมเย็น\n วิธีทำ\n" +
            "     1. ใส่น้ำหวานลงในแก้ว ตามด้วยนมข้นหวาน นมข้นจืด และน้ำร้อน 3/4 แก้ว คนให้เข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง โรยนมข้นจืดลงไปด้านบน พร้อมเสิร์ฟ\n");
    Facts f010 = new Facts(R.drawable.b9, "ชาเนสทีเย็น\n วิธีทำ\n" +
            "     1. ใส่ผงชาเนสทีและน้ำตาลทรายลงในแก้ว ตามด้วยน้ำร้อน คนให้ละลายเข้ากัน\n" +
            "     2. เติมนมข้นหวานลงไป คนให้เข้ากันอีกครั้ง\n" +
            "     3. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n");
    Facts f011 = new Facts(R.drawable.b10, "ไมโลเย็น\n วิธีทำ\n" +
            "     1. เทน้ำร้อนลงในแก้วประมาณ 1/4 ของแก้ว\n" +
            "     2. เทไมโล 3 in 1 ลงไป คนผสมให้ละลายจนเข้ากันดี\n" +
            "     3. เทน้ำแข็งลงไปประมาณ 3/4 ของแก้ว คนจนกว่าไมโลทั้งแก้วจะเย็นทั่ว ราดนมสด\n");
    Facts f012 = new Facts(R.drawable.b11, "โอวัลตินภูเขาไฟ\n วิธีทำ\n" +
            "     1. ต้มน้ำเปล่าให้เดือด เตรียมไว้\n" +
            "     2. ใส่โอวัลติน 5 ช้อนโต๊ะลงในแก้วทนความร้อน เติมนมข้นหวาน ใส่น้ำร้อนลงไปประมาณ 1/2 แก้ว จากนั้นคนให้เข้ากันดี\n" +
            "     3. ตักน้ำแข็งใส่ในแก้วทรงสูงให้เต็มแก้ว เทโอวัลตินที่ชงไว้ลงไป โปะผงโอวัลตินที่เหลือด้านบน\n");
    Facts f013 = new Facts(R.drawable.b12, "มะนาวโซดา\n วิธีทำ\n" +
            "     1. ทำน้ำเชื่อม โดยใส่น้ำตาลทรายและน้ำลงในหม้อ นำขึ้นตั้งไฟปานกลาง คนผสมจนน้ำตาลทรายละลาย พักทิ้งไว้จนเย็น เตรียมไว้ \n" +
            "     2. ใส่น้ำแข็งลงในแก้ว ตามด้วยน้ำเชื่อม น้ำมะนาว และโซดา คนผสมให้เข้ากัน เติมน้ำแข็ง พร้อมดื่ม\n");
    Facts f014 = new Facts(R.drawable.b13, "ชาเขียวนมสด\n วิธีทำ\n" +
            " ผสมผงชาเขียว นมสด น้ำเชื่อม และนมข้นหวาน คนผสมให้เข้ากัน (หรือใส่ในเชคเกอร์) เทใส่ลงในแก้วที่ใส่น้ำแข็งเตรียมไว้ โรยด้านบนด้วยนมสด \n");
    Facts f015 = new Facts(R.drawable.b14, "ชาเขียวมะนาว\n วิธีทำ\n" +
            "     1. ผสมชาเขียวกับน้ำร้อนจัด พักทิ้งไว้ ประมาณ 5-10 นาที จนน้ำเปลี่ยนสี กรองเอากากออก เตรียมไว้\n" +
            "     2. ใส่น้ำชาเขียวลงในแก้ว ตามด้วยน้ำเชื่อมและน้ำมะนาว คนผสมให้เข้ากัน ชิมรสตามชอบ ใส่น้ำแข็ง แต่งด้วยเลมอน\n");
    Facts f016 = new Facts(R.drawable.b15, "น้ำบ๊วย\n วิธีทำ\n" +
            "    1. ใส่น้ำตาลลงในแก้ว ใส่บ๊วยลงไปยีเอาแต่เนื้อ แยกเม็ดออก เติมน้ำบ๊วยลงไป\n" +
            "     2. ใส่น้ำร้อนลงไป คนให้น้ำตาลละลาย เติมน้ำแข็ง จัดเสิร์ฟ หรือไม่ต้องเติมน้ำแข็งแต่ปล่อยไว้ให้เย็นแล้วเก็บใส่ขวด แช่ในตู้เย็น\n");
    Facts f017 = new Facts(R.drawable.b16, "น้ำแดงมะนาวโซดา\n วิธีทำ\n" +
            "ใส่เกลือลงในแก้ว ตามด้วยน้ำแดงและน้ำมะนาว คนผสมให้เข้ากัน ใส่น้ำแข็งให้เต็มแก้ว เติมโซดาลงไป\n");
    Facts f018 = new Facts(R.drawable.b17, "น้ำเขียวมะนาวโซดา\n วิธีทำ\n" +
            "ใส่น้ำหวาน ตามด้วยโซดา บีบมะนาว คนให้เข้ากัน เติมน้ำแข็ง\n");

    Facts[] factArray = new Facts[]{
            f01, f02, f03, f04, f05, f06, f07, f09, f010, f011, f012, f013, f014, f015, f016, f017, f018,
    };
    public void shuffleFacts(){
        Collections.shuffle(Arrays.asList(factArray));
    }
    public void Recipedrinkopen (View view){
        Intent Recipedrinkform =new Intent(this,RecipedrinkActivity.class);
        startActivity(Recipedrinkform);
        finish();
    }
    public void openyoutube(View view){
        Showweb.loadUrl("https://www.youtube.com/");
    }
    public void openwed(View view){
        Showweb.loadUrl("https://www.thairath.co.th/news");
    }
}


