package com.example.randomeveryday;

import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

public class RecipedrinkActivity extends AppCompatActivity {
    ListView simpleList;
    String countryList[] = {"กาแฟโบราณ", "เนสกาแฟ","โอเลี้ยง","ยกล้อ","ชาเย็น","ชาดำเย็น","โกโก้เย็น","นมเย็น","ชาเนสทีเย็น","ไมโลเย็น","โอวัลตินภูเขาไฟ","มะนาวโซดา","ชาเขียวนมสด","ชาเขียวมะนาว","1.THE NIGHT HOUSE (2021) เดอะ ไนท์ เฮาส์"};
    int flags[] = {R.drawable.b1, R.drawable.b2,R.drawable.b3,R.drawable.b4,R.drawable.b5,R.drawable.b6,R.drawable.b7,R.drawable.b8,R.drawable.b9,R.drawable.b10,R.drawable.b11,R.drawable.b12,R.drawable.b13,R.drawable.b14,R.drawable.h1};
    String meaning[] ={"ส่วนผสม \n" +
            "1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\n" +
            "2.น้ำ 1+1/2 ถ้วย\n" +
            "3.น้ำตาลทราย 4 ช้อนโต๊ะ\n" +
            "4.นมข้นหวาน 9 ช้อนโต๊ะ\n" +
            "5.นมข้นจืด\n" +
            "6.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "3. ใส่น้ำตาลทรายลงในแก้ว ตามด้วยนมข้นหวาน เทโอเลี้ยงใส่ลงไป คนผสมให้เข้ากันจนน้ำตาลทรายละลาย เทใส่ลงในแก้วที่มีน้ำแข็งประมาณ 3/4 แก้ว แล้วเทนมข้นจืดลงไปจนเต็มแก้ว พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.ผงเนสกาแฟ 2 ช้อนชา\n" +
            "2.น้ำร้อน 3/4 แก้ว\n" +
            "3.นมข้นหวาน 4 ช้อนชา\n" +
            "4.น้ำตาลทราย 1 ช้อนชา\n" +
            "5.น้ำแข็ง 1 แก้ว\n" +
            "วิธีทำ\n" +
            "1. ใส่ผงกาแฟและน้ำตาลทรายลงในแก้ว เติมน้ำร้อนลงไป คนให้ละลาย\n" +
            "2. เติมนมข้นหวานลงไป คนให้เข้ากัน\n" +
            "3. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n","ส่วนผสม\n" +
            "1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\n" +
            "2.น้ำ 1+1/2 ถ้วย\n" +
            "3.น้ำตาลทราย 10 ช้อนโต๊ะ\n" +
            "4.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "3. ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็งจนเต็ม พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\n" +
            "2.น้ำ 1+1/2 ถ้วย\n" +
            "3.น้ำตาลทราย 10 ช้อนโต๊ะ\n" +
            "4.น้ำแข็ง\n" +
            "5.นมข้นจืด\n" +
            "วิธีทำ\n" +
            "1. ต้มน้ำจนเดือด เตรียมไว้\n" +
            "2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\n" +
            "3. ใส่น้ำตาลลงในแก้วตามชอบ เทโอเลี้ยงตามลงไปคนผสมให้น้ำตาลทรายละลาย เทใส่แก้วที่มีน้ำแข็ง ประมาณ 3/4 แก้ว แล้วเทนมข้นจืดลงไปจนเต็มแก้ว พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.ชาผงซีลอน 10 ช้อนชา (ในสูตรนี้ใช้ตราช้างทอง)\n" +
            "2.ชาผง 20 ช้อนชา (ในสูตรนี้ใช้ตรา 555)\n" +
            "3.ชาหอม 10 ช้อนชา (ในสูตรนี้ใช้ตราช้างทอง)\n" +
            "4.น้ำ 1,500 มิลลิลิตร\n" +
            "5.นมข้นหวาน 1+1/2 กระป๋อง\n" +
            "6.นมข้นจืด 20 ช้อนชา\n" +
            "7.ครีมเทียม 20 ช้อนชา\n" +
            "8.น้ำเชื่อมสำเร็จรูป 25 ช้อนชา\n" +
            "วิธีทำ\n" +
            "     1. ผสมชาทั้ง 3 อย่างเข้าด้วยกัน ลักษณะผงชาที่ได้จะมีทั้งลักษณะที่เป็นผงละเอียดและเป็นก้านใบชาที่หยาบ ๆ\n" +
            "     2. ตวงน้ำ 1,500 มิลลิลิตร แล้วนำไปต้มให้น้ำเดือด\n" +
            "     3. นำผงชาที่เตรียมไว้เทใส่ถุงกรองชา แล้วเทน้ำร้อนผ่านถุงกรองชาที่มีผงชาอยู่ โดยวางถุงกรองชาไว้ในกระบอกสเตนเลส (ซึ่งมีไว้สำหรับการชงชา แต่ถ้าใครไม่มีกระบอกสเตนเลสหรือมือใหม่หัดชง ก็ใช้พวกหม้อที่ใช้ตามบ้านแทนก็ได้)\n" +
            "**เทคนิคสำคัญ** ให้เทชาสลับไปสลับมาประมาณ 12 รอบ ให้ผงชาในถุงกรองชุ่มฉ่ำ เวลาเทก็ต้องชักถุงชาขึ้นมา (ถือถุงชาให้สูงขึ้นเพื่อให้ผงชาได้สัมผัสกับอากาศด้วย กลิ่นชาและรสชาติชาจะออกมาได้ดี)\n" +
            "     4. เมื่อเทชาสลับไปสลับมาครบ 12 รอบแล้ว จึงแช่ชาทิ้งไว้ประมาณ 5 นาที จากนั้นยกถุงกรองชาออก บีบน้ำชาที่เกาะอยู่ในถุงกรองชา คั้นน้ำออกมาให้หมด\n" +
            "     5. เติมครีมเทียมลงไปในน้ำชาที่พักไว้ คนผสมให้เข้ากัน\n" +
            "     6. เติมนมข้นหวานและนมข้นจืดลงไป (เพื่อเพิ่มความมัน หรือใครจะใส่นมข้นจืดมากกว่านี้ก็ไม่เป็นไร แล้วแต่ความชอบ) ตามด้วยน้ำเชื่อม คนผสมให้เข้ากันดี ชิมรสตามชอบ วางตั้งพักไว้รอให้เย็นก่อนแล้วจึงเทใส่ขวด\n","ส่วนผสม \n" +
            "1.น้ำชาที่ชงแล้ว (จากสูตรที่ 5) 3/4 แก้ว\n" +
            "2.น้ำตาลทราย 3 ช้อนโต๊ะ\n" +
            "3.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "     1. ใส่น้ำตาลทรายลงในแก้ว เทน้ำชาลงไปคนให้ละลายเข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.ผงโกโก้ 1 ช้อนชา\n" +
            "2.น้ำตาลทราย 1 ช้อนชา\n" +
            "3.น้ำร้อน 1/2 แก้ว\n" +
            "4.นมข้นหวาน 2 ช้อนชา\n" +
            "5.นมข้นจืด 1 ช้อนชา\n" +
            "6.น้ำแข็ง\n" +
            "7.นมข้นจืด (โรยหน้า)\n" +
            "วิธีชง\n" +
            "     1. ใส่ส่วนผสมทุกอย่างลงในแก้ว ตามด้วยน้ำร้อน คนให้เข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง ราดนมข้นจืดลงไปด้านบน พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.น้ำหวานกลิ่นสละ 2 ช้อนโต๊ะ\n" +
            "2.นมข้นหวาน 2 ช้อนชา\n" +
            "3.นมข้นจืด 1 ช้อนชา\n" +
            "4.น้ำร้อน 3/4 แก้ว\n" +
            "5.นมข้นจืด (โรยหน้า)\n" +
            "วิธีทำ\n" +
            "     1. ใส่น้ำหวานลงในแก้ว ตามด้วยนมข้นหวาน นมข้นจืด และน้ำร้อน 3/4 แก้ว คนให้เข้ากัน\n" +
            "     2. เทใส่แก้วที่มีน้ำแข็ง โรยนมข้นจืดลงไปด้านบน พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.ผงชาเนสที 2 ช้อนชา\n" +
            "2.น้ำตาลทราย 1 ช้อนชา\n" +
            "3.น้ำร้อน 3/4 แก้ว\n" +
            "4.นมข้นหวาน 4 ช้อนชา\n" +
            "5.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "1. ใส่ผงชาเนสทีและน้ำตาลทรายลงในแก้ว ตามด้วยน้ำร้อน คนให้ละลายเข้ากัน\n" +
            "2. เติมนมข้นหวานลงไป คนให้เข้ากันอีกครั้ง\n" +
            "3. เทใส่แก้วที่มีน้ำแข็ง พร้อมเสิร์ฟ\n","ส่วนผสม \n" +
            "1.น้ำร้อน\n" +
            "2.ไมโล (3 in 1) 1 ซอง\n" +
            "3.น้ำแข็ง\n" +
            "4.นมสด (สำหรับราดหน้า)\n" +
            "วิธีทำ\n" +
            "     1. เทน้ำร้อนลงในแก้วประมาณ 1/4 ของแก้ว\n" +
            "     2. เทไมโล 3 in 1 ลงไป คนผสมให้ละลายจนเข้ากันดี\n" +
            "     3. เทน้ำแข็งลงไปประมาณ 3/4 ของแก้ว คนจนกว่าไมโลทั้งแก้วจะเย็นทั่ว ราดนมสด\n","ส่วนผสม \n" +
            "1.ผงโอวัลติน 8 ช้อนโต๊ะ\n" +
            "2.นมข้นหวาน 3 ช้อนโต๊ะ\n" +
            "3.น้ำร้อน 1/2 แก้ว\n" +
            "4.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "     1. ต้มน้ำเปล่าให้เดือด เตรียมไว้\n" +
            "     2. ใส่โอวัลติน 5 ช้อนโต๊ะลงในแก้วทนความร้อน เติมนมข้นหวาน ใส่น้ำร้อนลงไปประมาณ 1/2 แก้ว จากนั้นคนให้เข้ากันดี\n" +
            "     3. ตักน้ำแข็งใส่ในแก้วทรงสูงให้เต็มแก้ว เทโอวัลตินที่ชงไว้ลงไป โปะผงโอวัลตินที่เหลือด้านบน\n","ส่วนผสม \n" +
            "1.น้ำตาลทราย\n" +
            "2.น้ำ\n" +
            "3.น้ำมะนาวคั้น (หรือน้ำเลมอนคั้น)\n" +
            "4.โซดา\n" +
            "5.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "     1. ทำน้ำเชื่อม โดยใส่น้ำตาลทรายและน้ำลงในหม้อ นำขึ้นตั้งไฟปานกลาง คนผสมจนน้ำตาลทรายละลาย พักทิ้งไว้จนเย็น เตรียมไว้ \n" +
            "     2. ใส่น้ำแข็งลงในแก้ว ตามด้วยน้ำเชื่อม น้ำมะนาว และโซดา คนผสมให้เข้ากัน เติมน้ำแข็ง พร้อมดื่ม\n","ส่วนผสม \n" +
            "1.ผงชาเขียวมัทฉะ 2 ช้อนชา\n" +
            "2.นมสด 160 มิลลิลิตร\n" +
            "3.น้ำเชื่อม 2 ช้อนโต๊ะ\n" +
            "4.นมข้นหวาน 1 ช้อนโต๊ะ\n" +
            "5.น้ำแข็ง 1 แก้ว (แก้วขนาด 16 ออนซ์)\n" +
            "6.นมสดสำหรับโรยหน้า\n" +
            "วิธีทำ\n" +
            " ผสมผงชาเขียว นมสด น้ำเชื่อม และนมข้นหวาน คนผสมให้เข้ากัน (หรือใส่ในเชคเกอร์) เทใส่ลงในแก้วที่ใส่น้ำแข็งเตรียมไว้ โรยด้านบนด้วยนมสด\n","ส่วนผสม \n" +
            "1.ชาเขียวสำหรับชง 2 ช้อนชา\n" +
            "2.น้ำร้อนจัด 500 มิลลิลิตร\n" +
            "3.น้ำเชื่อม ปริมาณตามชอบ\n" +
            "4.น้ำมะนาว ปริมาณตามชอบ\n" +
            "5.เลมอนเหลืองฝานแว่น สำหรับแต่ง\n" +
            "6.น้ำแข็ง\n" +
            "วิธีทำ\n" +
            "1. ผสมชาเขียวกับน้ำร้อนจัด พักทิ้งไว้ ประมาณ 5-10 นาที จนน้ำเปลี่ยนสี กรองเอากากออก เตรียมไว้\n" +
            "2. ใส่น้ำชาเขียวลงในแก้ว ตามด้วยน้ำเชื่อมและน้ำมะนาว คนผสมให้เข้ากัน ชิมรสตามชอบ ใส่น้ำแข็ง แต่งด้วยเลมอน\n"
    ,"\"ส่วนผสม \\n\" +\n" +
            "            \"1.ผงโอเลี้ยง 5-6 ช้อนโต๊ะ\\n\" +\n" +
            "            \"2.น้ำ 1+1/2 ถ้วย\\n\" +\n" +
            "            \"3.น้ำตาลทราย 4 ช้อนโต๊ะ\\n\" +\n" +
            "            \"4.นมข้นหวาน 9 ช้อนโต๊ะ\\n\" +\n" +
            "            \"5.นมข้นจืด\\n\" +\n" +
            "            \"6.น้ำแข็ง\\n\" +\n" +
            "            \"วิธีทำ\\n\" +\n" +
            "            \"1. ต้มน้ำจนเดือด เตรียมไว้\\n\" +\n" +
            "            \"2. ใส่ผงโอเลี้ยงลงในถุงกาแฟ นำไปวางลงในเหยือกสเตนเลส เทน้ำเดือดลงไป เขย่าถุงเล็กน้อยให้น้ำทั่วถึงกาแฟ พักทิ้งไว้ 7-10 นาที\\n\" +\n" +
            "            \"3. ใส่น้ำตาลทรายลงในแก้ว ตามด้วยนมข้นหวาน เทโอเลี้ยงใส่ลงไป คนผสมให้เข้ากันจนน้ำตาลทรายละลาย เทใส่ลงในแก้วที่มีน้ำแข็งประมาณ 3/4 แก้ว แล้วเทนมข้นจืดลงไปจนเต็มแก้ว พร้อมเสิร์ฟ\\n\""};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_recipedrink);
        simpleList = (ListView) findViewById(R.id.simpleListView);
        CustomAdapter customAdapter = new CustomAdapter(getApplicationContext(), countryList, flags);
        simpleList.setAdapter(customAdapter);
        simpleList.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                AlertDialog.Builder dialogBuilder = new
                        AlertDialog.Builder(view.getRootView().getContext());
                dialogBuilder.setTitle("Meaning:");
                dialogBuilder.setMessage(meaning[i]);
                dialogBuilder.setPositiveButton("Close",null);
                dialogBuilder.show();
            }
        });
    }
}

